espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/jpeg_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** JPEG_CONFIG_REG register
 *  Control and configuration registers
 */
#define JPEG_CONFIG_REG (DR_REG_JPEG_BASE + 0x0)
/** JPEG_FSM_RST : WT; bitpos: [0]; default: 0;
 *  fsm reset
 */
#define JPEG_FSM_RST    (BIT(0))
#define JPEG_FSM_RST_M  (JPEG_FSM_RST_V << JPEG_FSM_RST_S)
#define JPEG_FSM_RST_V  0x00000001U
#define JPEG_FSM_RST_S  0
/** JPEG_JPEG_START : WT; bitpos: [1]; default: 0;
 *  start to compress a new pic(in dma reg mode)
 */
#define JPEG_JPEG_START    (BIT(1))
#define JPEG_JPEG_START_M  (JPEG_JPEG_START_V << JPEG_JPEG_START_S)
#define JPEG_JPEG_START_V  0x00000001U
#define JPEG_JPEG_START_S  1
/** JPEG_QNR_PRECISION : R/W; bitpos: [2]; default: 0;
 *  0:8bit qnr,1:12bit qnr(TBD)
 */
#define JPEG_QNR_PRECISION    (BIT(2))
#define JPEG_QNR_PRECISION_M  (JPEG_QNR_PRECISION_V << JPEG_QNR_PRECISION_S)
#define JPEG_QNR_PRECISION_V  0x00000001U
#define JPEG_QNR_PRECISION_S  2
/** JPEG_FF_CHECK_EN : R/W; bitpos: [3]; default: 1;
 *  enable whether to add '00' after 'ff'
 */
#define JPEG_FF_CHECK_EN    (BIT(3))
#define JPEG_FF_CHECK_EN_M  (JPEG_FF_CHECK_EN_V << JPEG_FF_CHECK_EN_S)
#define JPEG_FF_CHECK_EN_V  0x00000001U
#define JPEG_FF_CHECK_EN_S  3
/** JPEG_SAMPLE_SEL : R/W; bitpos: [5:4]; default: 1;
 *  0:yuv444,1:yuv422, 2:yuv420
 */
#define JPEG_SAMPLE_SEL    0x00000003U
#define JPEG_SAMPLE_SEL_M  (JPEG_SAMPLE_SEL_V << JPEG_SAMPLE_SEL_S)
#define JPEG_SAMPLE_SEL_V  0x00000003U
#define JPEG_SAMPLE_SEL_S  4
/** JPEG_DMA_LINKLIST_MODE : RO; bitpos: [6]; default: 1;
 *  1:use linklist to configure dma
 */
#define JPEG_DMA_LINKLIST_MODE    (BIT(6))
#define JPEG_DMA_LINKLIST_MODE_M  (JPEG_DMA_LINKLIST_MODE_V << JPEG_DMA_LINKLIST_MODE_S)
#define JPEG_DMA_LINKLIST_MODE_V  0x00000001U
#define JPEG_DMA_LINKLIST_MODE_S  6
/** JPEG_DEBUG_DIRECT_OUT_EN : R/W; bitpos: [7]; default: 0;
 *  0:normal mode,1:debug mode for direct output from input
 */
#define JPEG_DEBUG_DIRECT_OUT_EN    (BIT(7))
#define JPEG_DEBUG_DIRECT_OUT_EN_M  (JPEG_DEBUG_DIRECT_OUT_EN_V << JPEG_DEBUG_DIRECT_OUT_EN_S)
#define JPEG_DEBUG_DIRECT_OUT_EN_V  0x00000001U
#define JPEG_DEBUG_DIRECT_OUT_EN_S  7
/** JPEG_QNR_FIFO_EN : R/W; bitpos: [8]; default: 1;
 *  0:use non-fifo way to access qnr ram,1:use fifo way to access qnr ram
 */
#define JPEG_QNR_FIFO_EN    (BIT(8))
#define JPEG_QNR_FIFO_EN_M  (JPEG_QNR_FIFO_EN_V << JPEG_QNR_FIFO_EN_S)
#define JPEG_QNR_FIFO_EN_V  0x00000001U
#define JPEG_QNR_FIFO_EN_S  8
/** JPEG_LQNR_TBL_SEL : R/W; bitpos: [10:9]; default: 0;
 *  choose  luminance quntization table id(TBD)
 */
#define JPEG_LQNR_TBL_SEL    0x00000003U
#define JPEG_LQNR_TBL_SEL_M  (JPEG_LQNR_TBL_SEL_V << JPEG_LQNR_TBL_SEL_S)
#define JPEG_LQNR_TBL_SEL_V  0x00000003U
#define JPEG_LQNR_TBL_SEL_S  9
/** JPEG_CQNR_TBL_SEL : R/W; bitpos: [12:11]; default: 1;
 *  choose  chrominance quntization table id (TBD)
 */
#define JPEG_CQNR_TBL_SEL    0x00000003U
#define JPEG_CQNR_TBL_SEL_M  (JPEG_CQNR_TBL_SEL_V << JPEG_CQNR_TBL_SEL_S)
#define JPEG_CQNR_TBL_SEL_V  0x00000003U
#define JPEG_CQNR_TBL_SEL_S  11
/** JPEG_COLOR_SPACE : R/W; bitpos: [14:13]; default: 0;
 *  configure picture's color space:0-rb888,1-yuv422,2-rgb565, 3-gray
 */
#define JPEG_COLOR_SPACE    0x00000003U
#define JPEG_COLOR_SPACE_M  (JPEG_COLOR_SPACE_V << JPEG_COLOR_SPACE_S)
#define JPEG_COLOR_SPACE_V  0x00000003U
#define JPEG_COLOR_SPACE_S  13
/** JPEG_DHT_FIFO_EN : R/W; bitpos: [15]; default: 1;
 *  0:use non-fifo way to write dht len_total/codemin/value table,1:use fifo way to
 *  write dht len_total/codemin/value table. Reading dht len_total/codemin/value table
 *  only has nonfifo way
 */
#define JPEG_DHT_FIFO_EN    (BIT(15))
#define JPEG_DHT_FIFO_EN_M  (JPEG_DHT_FIFO_EN_V << JPEG_DHT_FIFO_EN_S)
#define JPEG_DHT_FIFO_EN_V  0x00000001U
#define JPEG_DHT_FIFO_EN_S  15
/** JPEG_MEM_CLK_FORCE_ON : R/W; bitpos: [16]; default: 0;
 *  force memory's clock enabled
 */
#define JPEG_MEM_CLK_FORCE_ON    (BIT(16))
#define JPEG_MEM_CLK_FORCE_ON_M  (JPEG_MEM_CLK_FORCE_ON_V << JPEG_MEM_CLK_FORCE_ON_S)
#define JPEG_MEM_CLK_FORCE_ON_V  0x00000001U
#define JPEG_MEM_CLK_FORCE_ON_S  16
/** JPEG_DECODE_TIMEOUT_THRES : R/W; bitpos: [22:17]; default: 32;
 *  decode pause period to trigger decode_timeout int, the timeout periods =2 power
 *  (reg_decode_timeout_thres) -1
 */
#define JPEG_DECODE_TIMEOUT_THRES    0x0000003FU
#define JPEG_DECODE_TIMEOUT_THRES_M  (JPEG_DECODE_TIMEOUT_THRES_V << JPEG_DECODE_TIMEOUT_THRES_S)
#define JPEG_DECODE_TIMEOUT_THRES_V  0x0000003FU
#define JPEG_DECODE_TIMEOUT_THRES_S  17
/** JPEG_DECODE_TIMEOUT_TASK_SEL : R/W; bitpos: [23]; default: 0;
 *  0: software use reset to abort decode process ,1: decoder abort decode process by
 *  itself
 */
#define JPEG_DECODE_TIMEOUT_TASK_SEL    (BIT(23))
#define JPEG_DECODE_TIMEOUT_TASK_SEL_M  (JPEG_DECODE_TIMEOUT_TASK_SEL_V << JPEG_DECODE_TIMEOUT_TASK_SEL_S)
#define JPEG_DECODE_TIMEOUT_TASK_SEL_V  0x00000001U
#define JPEG_DECODE_TIMEOUT_TASK_SEL_S  23
/** JPEG_SOFT_RST : R/W; bitpos: [24]; default: 0;
 *  when set to 1, soft reset JPEG module except jpeg_reg module
 */
#define JPEG_SOFT_RST    (BIT(24))
#define JPEG_SOFT_RST_M  (JPEG_SOFT_RST_V << JPEG_SOFT_RST_S)
#define JPEG_SOFT_RST_V  0x00000001U
#define JPEG_SOFT_RST_S  24
/** JPEG_FIFO_RST : R/W; bitpos: [25]; default: 0;
 *  fifo reset
 */
#define JPEG_FIFO_RST    (BIT(25))
#define JPEG_FIFO_RST_M  (JPEG_FIFO_RST_V << JPEG_FIFO_RST_S)
#define JPEG_FIFO_RST_V  0x00000001U
#define JPEG_FIFO_RST_S  25
/** JPEG_PIXEL_REV : R/W; bitpos: [26]; default: 0;
 *  reverse the source color pixel
 */
#define JPEG_PIXEL_REV    (BIT(26))
#define JPEG_PIXEL_REV_M  (JPEG_PIXEL_REV_V << JPEG_PIXEL_REV_S)
#define JPEG_PIXEL_REV_V  0x00000001U
#define JPEG_PIXEL_REV_S  26
/** JPEG_TAILER_EN : R/W; bitpos: [27]; default: 0;
 *  set this bit to add EOI of '0xffd9' at the end of bitstream
 */
#define JPEG_TAILER_EN    (BIT(27))
#define JPEG_TAILER_EN_M  (JPEG_TAILER_EN_V << JPEG_TAILER_EN_S)
#define JPEG_TAILER_EN_V  0x00000001U
#define JPEG_TAILER_EN_S  27
/** JPEG_PAUSE_EN : R/W; bitpos: [28]; default: 0;
 *  set this bit to pause jpeg encoding
 */
#define JPEG_PAUSE_EN    (BIT(28))
#define JPEG_PAUSE_EN_M  (JPEG_PAUSE_EN_V << JPEG_PAUSE_EN_S)
#define JPEG_PAUSE_EN_V  0x00000001U
#define JPEG_PAUSE_EN_S  28
/** JPEG_MEM_FORCE_PD : R/W; bitpos: [29]; default: 0;
 *  0: no operation,1:force jpeg memory to power down
 */
#define JPEG_MEM_FORCE_PD    (BIT(29))
#define JPEG_MEM_FORCE_PD_M  (JPEG_MEM_FORCE_PD_V << JPEG_MEM_FORCE_PD_S)
#define JPEG_MEM_FORCE_PD_V  0x00000001U
#define JPEG_MEM_FORCE_PD_S  29
/** JPEG_MEM_FORCE_PU : R/W; bitpos: [30]; default: 0;
 *  0: no operation,1:force jpeg memory to power up
 */
#define JPEG_MEM_FORCE_PU    (BIT(30))
#define JPEG_MEM_FORCE_PU_M  (JPEG_MEM_FORCE_PU_V << JPEG_MEM_FORCE_PU_S)
#define JPEG_MEM_FORCE_PU_V  0x00000001U
#define JPEG_MEM_FORCE_PU_S  30
/** JPEG_MODE : R/W; bitpos: [31]; default: 0;
 *  0:encoder mode, 1: decoder mode
 */
#define JPEG_MODE    (BIT(31))
#define JPEG_MODE_M  (JPEG_MODE_V << JPEG_MODE_S)
#define JPEG_MODE_V  0x00000001U
#define JPEG_MODE_S  31

/** JPEG_DQT_INFO_REG register
 *  Control and configuration registers
 */
#define JPEG_DQT_INFO_REG (DR_REG_JPEG_BASE + 0x4)
/** JPEG_T0_DQT_INFO : R/W; bitpos: [7:0]; default: 0;
 *  Configure dqt table0's quantization coefficient precision in bit[7:4], configure
 *  dqt table0's table id in bit[3:0]
 */
#define JPEG_T0_DQT_INFO    0x000000FFU
#define JPEG_T0_DQT_INFO_M  (JPEG_T0_DQT_INFO_V << JPEG_T0_DQT_INFO_S)
#define JPEG_T0_DQT_INFO_V  0x000000FFU
#define JPEG_T0_DQT_INFO_S  0
/** JPEG_T1_DQT_INFO : R/W; bitpos: [15:8]; default: 1;
 *  Configure dqt table1's quantization coefficient precision in bit[7:4], configure
 *  dqt table1's table id in bit[3:0]
 */
#define JPEG_T1_DQT_INFO    0x000000FFU
#define JPEG_T1_DQT_INFO_M  (JPEG_T1_DQT_INFO_V << JPEG_T1_DQT_INFO_S)
#define JPEG_T1_DQT_INFO_V  0x000000FFU
#define JPEG_T1_DQT_INFO_S  8
/** JPEG_T2_DQT_INFO : R/W; bitpos: [23:16]; default: 2;
 *  Configure dqt table2's quantization coefficient precision in bit[7:4], configure
 *  dqt table2's table id in bit[3:0]
 */
#define JPEG_T2_DQT_INFO    0x000000FFU
#define JPEG_T2_DQT_INFO_M  (JPEG_T2_DQT_INFO_V << JPEG_T2_DQT_INFO_S)
#define JPEG_T2_DQT_INFO_V  0x000000FFU
#define JPEG_T2_DQT_INFO_S  16
/** JPEG_T3_DQT_INFO : R/W; bitpos: [31:24]; default: 3;
 *  Configure dqt table3's quantization coefficient precision in bit[7:4], configure
 *  dqt table3's table id in bit[3:0]
 */
#define JPEG_T3_DQT_INFO    0x000000FFU
#define JPEG_T3_DQT_INFO_M  (JPEG_T3_DQT_INFO_V << JPEG_T3_DQT_INFO_S)
#define JPEG_T3_DQT_INFO_V  0x000000FFU
#define JPEG_T3_DQT_INFO_S  24

/** JPEG_PIC_SIZE_REG register
 *  Control and configuration registers
 */
#define JPEG_PIC_SIZE_REG (DR_REG_JPEG_BASE + 0x8)
/** JPEG_VA : R/W; bitpos: [15:0]; default: 480;
 *  configure picture's height. when encode, the max configurable bits is 14, when
 *  decode, the max configurable bits is 16
 */
#define JPEG_VA    0x0000FFFFU
#define JPEG_VA_M  (JPEG_VA_V << JPEG_VA_S)
#define JPEG_VA_V  0x0000FFFFU
#define JPEG_VA_S  0
/** JPEG_HA : R/W; bitpos: [31:16]; default: 640;
 *  configure picture's width. when encode, the max configurable bits is 14, when
 *  decode, the max configurable bits is 16
 */
#define JPEG_HA    0x0000FFFFU
#define JPEG_HA_M  (JPEG_HA_V << JPEG_HA_S)
#define JPEG_HA_V  0x0000FFFFU
#define JPEG_HA_S  16

/** JPEG_EXTD_CONFIG_REG register
 *  Control and configuration registers
 */
#define JPEG_EXTD_CONFIG_REG (DR_REG_JPEG_BASE + 0xc)
/** JPEG_EXTD_COLOR_SPACE_EN : R/W; bitpos: [0]; default: 0;
 *  Configure whether to extend picture's color space
 *  0:disable
 *  1:enable
 */
#define JPEG_EXTD_COLOR_SPACE_EN    (BIT(0))
#define JPEG_EXTD_COLOR_SPACE_EN_M  (JPEG_EXTD_COLOR_SPACE_EN_V << JPEG_EXTD_COLOR_SPACE_EN_S)
#define JPEG_EXTD_COLOR_SPACE_EN_V  0x00000001U
#define JPEG_EXTD_COLOR_SPACE_EN_S  0
/** JPEG_EXTD_COLOR_SPACE : R/W; bitpos: [1]; default: 0;
 *  Configure extended picture's color space. Valid when JPEG_EXTD_COLOR_SPACE_EN
 *  configured to 1
 *  0:yuv444
 *  1:yuv420
 */
#define JPEG_EXTD_COLOR_SPACE    (BIT(1))
#define JPEG_EXTD_COLOR_SPACE_M  (JPEG_EXTD_COLOR_SPACE_V << JPEG_EXTD_COLOR_SPACE_S)
#define JPEG_EXTD_COLOR_SPACE_V  0x00000001U
#define JPEG_EXTD_COLOR_SPACE_S  1

/** JPEG_T0QNR_REG register
 *  Control and configuration registers
 */
#define JPEG_T0QNR_REG (DR_REG_JPEG_BASE + 0x10)
/** JPEG_T0_QNR_VAL : HRO; bitpos: [31:0]; default: 0;
 *  write this reg to configure 64 quantization coefficient in t0 table
 */
#define JPEG_T0_QNR_VAL    0xFFFFFFFFU
#define JPEG_T0_QNR_VAL_M  (JPEG_T0_QNR_VAL_V << JPEG_T0_QNR_VAL_S)
#define JPEG_T0_QNR_VAL_V  0xFFFFFFFFU
#define JPEG_T0_QNR_VAL_S  0

/** JPEG_T1QNR_REG register
 *  Control and configuration registers
 */
#define JPEG_T1QNR_REG (DR_REG_JPEG_BASE + 0x14)
/** JPEG_T1_QNR_VAL : HRO; bitpos: [31:0]; default: 0;
 *  write this reg to configure 64 quantization coefficient in t1 table
 */
#define JPEG_T1_QNR_VAL    0xFFFFFFFFU
#define JPEG_T1_QNR_VAL_M  (JPEG_T1_QNR_VAL_V << JPEG_T1_QNR_VAL_S)
#define JPEG_T1_QNR_VAL_V  0xFFFFFFFFU
#define JPEG_T1_QNR_VAL_S  0

/** JPEG_T2QNR_REG register
 *  Control and configuration registers
 */
#define JPEG_T2QNR_REG (DR_REG_JPEG_BASE + 0x18)
/** JPEG_T2_QNR_VAL : HRO; bitpos: [31:0]; default: 0;
 *  write this reg to configure 64 quantization coefficient in t2 table
 */
#define JPEG_T2_QNR_VAL    0xFFFFFFFFU
#define JPEG_T2_QNR_VAL_M  (JPEG_T2_QNR_VAL_V << JPEG_T2_QNR_VAL_S)
#define JPEG_T2_QNR_VAL_V  0xFFFFFFFFU
#define JPEG_T2_QNR_VAL_S  0

/** JPEG_T3QNR_REG register
 *  Control and configuration registers
 */
#define JPEG_T3QNR_REG (DR_REG_JPEG_BASE + 0x1c)
/** JPEG_T3_QNR_VAL : HRO; bitpos: [31:0]; default: 0;
 *  write this reg to configure 64 quantization coefficient in t3 table
 */
#define JPEG_T3_QNR_VAL    0xFFFFFFFFU
#define JPEG_T3_QNR_VAL_M  (JPEG_T3_QNR_VAL_V << JPEG_T3_QNR_VAL_S)
#define JPEG_T3_QNR_VAL_V  0xFFFFFFFFU
#define JPEG_T3_QNR_VAL_S  0

/** JPEG_DECODE_CONF_REG register
 *  Control and configuration registers
 */
#define JPEG_DECODE_CONF_REG (DR_REG_JPEG_BASE + 0x20)
/** JPEG_RESTART_INTERVAL : R/W; bitpos: [15:0]; default: 0;
 *  configure restart interval in DRI marker when decode
 */
#define JPEG_RESTART_INTERVAL    0x0000FFFFU
#define JPEG_RESTART_INTERVAL_M  (JPEG_RESTART_INTERVAL_V << JPEG_RESTART_INTERVAL_S)
#define JPEG_RESTART_INTERVAL_V  0x0000FFFFU
#define JPEG_RESTART_INTERVAL_S  0
/** JPEG_COMPONENT_NUM : R/W; bitpos: [23:16]; default: 3;
 *  configure number of components in frame when decode
 */
#define JPEG_COMPONENT_NUM    0x000000FFU
#define JPEG_COMPONENT_NUM_M  (JPEG_COMPONENT_NUM_V << JPEG_COMPONENT_NUM_S)
#define JPEG_COMPONENT_NUM_V  0x000000FFU
#define JPEG_COMPONENT_NUM_S  16
/** JPEG_SW_DHT_EN : RO; bitpos: [24]; default: 1;
 *  software decode dht table enable
 */
#define JPEG_SW_DHT_EN    (BIT(24))
#define JPEG_SW_DHT_EN_M  (JPEG_SW_DHT_EN_V << JPEG_SW_DHT_EN_S)
#define JPEG_SW_DHT_EN_V  0x00000001U
#define JPEG_SW_DHT_EN_S  24
/** JPEG_SOS_CHECK_BYTE_NUM : R/W; bitpos: [26:25]; default: 3;
 *  Configure the byte number to check next sos marker in the multi-scan picture after
 *  one scan is decoded down. The real check number is reg_sos_check_byte_num+1
 */
#define JPEG_SOS_CHECK_BYTE_NUM    0x00000003U
#define JPEG_SOS_CHECK_BYTE_NUM_M  (JPEG_SOS_CHECK_BYTE_NUM_V << JPEG_SOS_CHECK_BYTE_NUM_S)
#define JPEG_SOS_CHECK_BYTE_NUM_V  0x00000003U
#define JPEG_SOS_CHECK_BYTE_NUM_S  25
/** JPEG_RST_CHECK_BYTE_NUM : R/W; bitpos: [28:27]; default: 3;
 *  Configure the byte number to check next rst marker after one rst interval is
 *  decoded down. The real check number is reg_rst_check_byte_num+1
 */
#define JPEG_RST_CHECK_BYTE_NUM    0x00000003U
#define JPEG_RST_CHECK_BYTE_NUM_M  (JPEG_RST_CHECK_BYTE_NUM_V << JPEG_RST_CHECK_BYTE_NUM_S)
#define JPEG_RST_CHECK_BYTE_NUM_V  0x00000003U
#define JPEG_RST_CHECK_BYTE_NUM_S  27
/** JPEG_MULTI_SCAN_ERR_CHECK : R/W; bitpos: [29]; default: 0;
 *  reserved for decoder
 */
#define JPEG_MULTI_SCAN_ERR_CHECK    (BIT(29))
#define JPEG_MULTI_SCAN_ERR_CHECK_M  (JPEG_MULTI_SCAN_ERR_CHECK_V << JPEG_MULTI_SCAN_ERR_CHECK_S)
#define JPEG_MULTI_SCAN_ERR_CHECK_V  0x00000001U
#define JPEG_MULTI_SCAN_ERR_CHECK_S  29
/** JPEG_DEZIGZAG_READY_CTL : R/W; bitpos: [30]; default: 1;
 *  reserved for decoder
 */
#define JPEG_DEZIGZAG_READY_CTL    (BIT(30))
#define JPEG_DEZIGZAG_READY_CTL_M  (JPEG_DEZIGZAG_READY_CTL_V << JPEG_DEZIGZAG_READY_CTL_S)
#define JPEG_DEZIGZAG_READY_CTL_V  0x00000001U
#define JPEG_DEZIGZAG_READY_CTL_S  30

/** JPEG_C0_REG register
 *  Control and configuration registers
 */
#define JPEG_C0_REG (DR_REG_JPEG_BASE + 0x24)
/** JPEG_C0_DQT_TBL_SEL : R/W; bitpos: [7:0]; default: 0;
 *  choose  c0 quntization table id (TBD)
 */
#define JPEG_C0_DQT_TBL_SEL    0x000000FFU
#define JPEG_C0_DQT_TBL_SEL_M  (JPEG_C0_DQT_TBL_SEL_V << JPEG_C0_DQT_TBL_SEL_S)
#define JPEG_C0_DQT_TBL_SEL_V  0x000000FFU
#define JPEG_C0_DQT_TBL_SEL_S  0
/** JPEG_C0_Y_FACTOR : R/W; bitpos: [11:8]; default: 1;
 *  vertical sampling factor of c0
 */
#define JPEG_C0_Y_FACTOR    0x0000000FU
#define JPEG_C0_Y_FACTOR_M  (JPEG_C0_Y_FACTOR_V << JPEG_C0_Y_FACTOR_S)
#define JPEG_C0_Y_FACTOR_V  0x0000000FU
#define JPEG_C0_Y_FACTOR_S  8
/** JPEG_C0_X_FACTOR : R/W; bitpos: [15:12]; default: 1;
 *  horizontal sampling factor of c0
 */
#define JPEG_C0_X_FACTOR    0x0000000FU
#define JPEG_C0_X_FACTOR_M  (JPEG_C0_X_FACTOR_V << JPEG_C0_X_FACTOR_S)
#define JPEG_C0_X_FACTOR_V  0x0000000FU
#define JPEG_C0_X_FACTOR_S  12
/** JPEG_C0_ID : R/W; bitpos: [23:16]; default: 0;
 *  the identifier of c0
 */
#define JPEG_C0_ID    0x000000FFU
#define JPEG_C0_ID_M  (JPEG_C0_ID_V << JPEG_C0_ID_S)
#define JPEG_C0_ID_V  0x000000FFU
#define JPEG_C0_ID_S  16

