espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/jpeg_reg.h
/** JPEG_INT_ENA_REG register
 *  Interrupt enable registers
 */
#define JPEG_INT_ENA_REG (DR_REG_JPEG_BASE + 0x3c)
/** JPEG_DONE_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  This enable interrupt bit turns to high level when JPEG finishes encoding a
 *  picture..
 */
#define JPEG_DONE_INT_ENA    (BIT(0))
#define JPEG_DONE_INT_ENA_M  (JPEG_DONE_INT_ENA_V << JPEG_DONE_INT_ENA_S)
#define JPEG_DONE_INT_ENA_V  0x00000001U
#define JPEG_DONE_INT_ENA_S  0
/** JPEG_RLE_PARALLEL_ERR_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  The enable interrupt bit to sign that rle parallel error when decoding.
 */
#define JPEG_RLE_PARALLEL_ERR_INT_ENA    (BIT(1))
#define JPEG_RLE_PARALLEL_ERR_INT_ENA_M  (JPEG_RLE_PARALLEL_ERR_INT_ENA_V << JPEG_RLE_PARALLEL_ERR_INT_ENA_S)
#define JPEG_RLE_PARALLEL_ERR_INT_ENA_V  0x00000001U
#define JPEG_RLE_PARALLEL_ERR_INT_ENA_S  1
/** JPEG_CID_ERR_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  The enable interrupt bit to sign that scan id check with component fails when
 *  decoding.
 */
#define JPEG_CID_ERR_INT_ENA    (BIT(2))
#define JPEG_CID_ERR_INT_ENA_M  (JPEG_CID_ERR_INT_ENA_V << JPEG_CID_ERR_INT_ENA_S)
#define JPEG_CID_ERR_INT_ENA_V  0x00000001U
#define JPEG_CID_ERR_INT_ENA_S  2
/** JPEG_C_DHT_DC_ID_ERR_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  The enable interrupt bit to sign that scan component's dc dht id check with dc dht
 *  table's id fails when decoding.
 */
#define JPEG_C_DHT_DC_ID_ERR_INT_ENA    (BIT(3))
#define JPEG_C_DHT_DC_ID_ERR_INT_ENA_M  (JPEG_C_DHT_DC_ID_ERR_INT_ENA_V << JPEG_C_DHT_DC_ID_ERR_INT_ENA_S)
#define JPEG_C_DHT_DC_ID_ERR_INT_ENA_V  0x00000001U
#define JPEG_C_DHT_DC_ID_ERR_INT_ENA_S  3
/** JPEG_C_DHT_AC_ID_ERR_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  The enable interrupt bit to sign that scan component's ac dht id check with ac dht
 *  table's id fails when decoding.
 */
#define JPEG_C_DHT_AC_ID_ERR_INT_ENA    (BIT(4))
#define JPEG_C_DHT_AC_ID_ERR_INT_ENA_M  (JPEG_C_DHT_AC_ID_ERR_INT_ENA_V << JPEG_C_DHT_AC_ID_ERR_INT_ENA_S)
#define JPEG_C_DHT_AC_ID_ERR_INT_ENA_V  0x00000001U
#define JPEG_C_DHT_AC_ID_ERR_INT_ENA_S  4
/** JPEG_C_DQT_ID_ERR_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  The enable interrupt bit to sign that scan component's dqt id check with dqt
 *  table's id fails when decoding.
 */
#define JPEG_C_DQT_ID_ERR_INT_ENA    (BIT(5))
#define JPEG_C_DQT_ID_ERR_INT_ENA_M  (JPEG_C_DQT_ID_ERR_INT_ENA_V << JPEG_C_DQT_ID_ERR_INT_ENA_S)
#define JPEG_C_DQT_ID_ERR_INT_ENA_V  0x00000001U
#define JPEG_C_DQT_ID_ERR_INT_ENA_S  5
/** JPEG_RST_UXP_ERR_INT_ENA : R/W; bitpos: [6]; default: 0;
 *  The enable interrupt bit to sign that RST header marker is detected but restart
 *  interval is 0 when decoding.
 */
#define JPEG_RST_UXP_ERR_INT_ENA    (BIT(6))
#define JPEG_RST_UXP_ERR_INT_ENA_M  (JPEG_RST_UXP_ERR_INT_ENA_V << JPEG_RST_UXP_ERR_INT_ENA_S)
#define JPEG_RST_UXP_ERR_INT_ENA_V  0x00000001U
#define JPEG_RST_UXP_ERR_INT_ENA_S  6
/** JPEG_RST_CHECK_NONE_ERR_INT_ENA : R/W; bitpos: [7]; default: 0;
 *  The enable interrupt bit to sign that RST header marker is not detected but restart
 *  interval is not 0 when decoding.
 */
#define JPEG_RST_CHECK_NONE_ERR_INT_ENA    (BIT(7))
#define JPEG_RST_CHECK_NONE_ERR_INT_ENA_M  (JPEG_RST_CHECK_NONE_ERR_INT_ENA_V << JPEG_RST_CHECK_NONE_ERR_INT_ENA_S)
#define JPEG_RST_CHECK_NONE_ERR_INT_ENA_V  0x00000001U
#define JPEG_RST_CHECK_NONE_ERR_INT_ENA_S  7
/** JPEG_RST_CHECK_POS_ERR_INT_ENA : R/W; bitpos: [8]; default: 0;
 *  The enable interrupt bit to sign that RST header marker position mismatches with
 *  restart interval when decoding.
 */
#define JPEG_RST_CHECK_POS_ERR_INT_ENA    (BIT(8))
#define JPEG_RST_CHECK_POS_ERR_INT_ENA_M  (JPEG_RST_CHECK_POS_ERR_INT_ENA_V << JPEG_RST_CHECK_POS_ERR_INT_ENA_S)
#define JPEG_RST_CHECK_POS_ERR_INT_ENA_V  0x00000001U
#define JPEG_RST_CHECK_POS_ERR_INT_ENA_S  8
/** JPEG_OUT_EOF_INT_ENA : R/W; bitpos: [9]; default: 0;
 *  The enable interrupt bit turns to high level when the last pixel of one square has
 *  been transmitted for Tx channel.
 */
#define JPEG_OUT_EOF_INT_ENA    (BIT(9))
#define JPEG_OUT_EOF_INT_ENA_M  (JPEG_OUT_EOF_INT_ENA_V << JPEG_OUT_EOF_INT_ENA_S)
#define JPEG_OUT_EOF_INT_ENA_V  0x00000001U
#define JPEG_OUT_EOF_INT_ENA_S  9
/** JPEG_SR_COLOR_MODE_ERR_INT_ENA : R/W; bitpos: [10]; default: 0;
 *  The enable interrupt bit to sign that the selected source color mode is not
 *  supported.
 */
#define JPEG_SR_COLOR_MODE_ERR_INT_ENA    (BIT(10))
#define JPEG_SR_COLOR_MODE_ERR_INT_ENA_M  (JPEG_SR_COLOR_MODE_ERR_INT_ENA_V << JPEG_SR_COLOR_MODE_ERR_INT_ENA_S)
#define JPEG_SR_COLOR_MODE_ERR_INT_ENA_V  0x00000001U
#define JPEG_SR_COLOR_MODE_ERR_INT_ENA_S  10
/** JPEG_DCT_DONE_INT_ENA : R/W; bitpos: [11]; default: 0;
 *  The enable interrupt bit to sign that one dct calculation is finished.
 */
#define JPEG_DCT_DONE_INT_ENA    (BIT(11))
#define JPEG_DCT_DONE_INT_ENA_M  (JPEG_DCT_DONE_INT_ENA_V << JPEG_DCT_DONE_INT_ENA_S)
#define JPEG_DCT_DONE_INT_ENA_V  0x00000001U
#define JPEG_DCT_DONE_INT_ENA_S  11
/** JPEG_BS_LAST_BLOCK_EOF_INT_ENA : R/W; bitpos: [12]; default: 0;
 *  The enable interrupt bit to sign that the coding process for last block is finished.
 */
#define JPEG_BS_LAST_BLOCK_EOF_INT_ENA    (BIT(12))
#define JPEG_BS_LAST_BLOCK_EOF_INT_ENA_M  (JPEG_BS_LAST_BLOCK_EOF_INT_ENA_V << JPEG_BS_LAST_BLOCK_EOF_INT_ENA_S)
#define JPEG_BS_LAST_BLOCK_EOF_INT_ENA_V  0x00000001U
#define JPEG_BS_LAST_BLOCK_EOF_INT_ENA_S  12
/** JPEG_SCAN_CHECK_NONE_ERR_INT_ENA : R/W; bitpos: [13]; default: 0;
 *  The enable interrupt bit to sign that SOS header marker is not detected but there
 *  are still components left to be decoded.
 */
#define JPEG_SCAN_CHECK_NONE_ERR_INT_ENA    (BIT(13))
#define JPEG_SCAN_CHECK_NONE_ERR_INT_ENA_M  (JPEG_SCAN_CHECK_NONE_ERR_INT_ENA_V << JPEG_SCAN_CHECK_NONE_ERR_INT_ENA_S)
#define JPEG_SCAN_CHECK_NONE_ERR_INT_ENA_V  0x00000001U
#define JPEG_SCAN_CHECK_NONE_ERR_INT_ENA_S  13
/** JPEG_SCAN_CHECK_POS_ERR_INT_ENA : R/W; bitpos: [14]; default: 0;
 *  The enable interrupt bit to sign that SOS header marker position wrong when
 *  decoding.
 */
#define JPEG_SCAN_CHECK_POS_ERR_INT_ENA    (BIT(14))
#define JPEG_SCAN_CHECK_POS_ERR_INT_ENA_M  (JPEG_SCAN_CHECK_POS_ERR_INT_ENA_V << JPEG_SCAN_CHECK_POS_ERR_INT_ENA_S)
#define JPEG_SCAN_CHECK_POS_ERR_INT_ENA_V  0x00000001U
#define JPEG_SCAN_CHECK_POS_ERR_INT_ENA_S  14
/** JPEG_UXP_DET_INT_ENA : R/W; bitpos: [15]; default: 0;
 *  The enable interrupt bit to sign that unsupported header marker is detected when
 *  decoding.
 */
#define JPEG_UXP_DET_INT_ENA    (BIT(15))
#define JPEG_UXP_DET_INT_ENA_M  (JPEG_UXP_DET_INT_ENA_V << JPEG_UXP_DET_INT_ENA_S)
#define JPEG_UXP_DET_INT_ENA_V  0x00000001U
#define JPEG_UXP_DET_INT_ENA_S  15
/** JPEG_EN_FRAME_EOF_ERR_INT_ENA : R/W; bitpos: [16]; default: 0;
 *  The enable interrupt bit to sign that received pixel blocks are smaller than
 *  expected when encoding.
 */
#define JPEG_EN_FRAME_EOF_ERR_INT_ENA    (BIT(16))
#define JPEG_EN_FRAME_EOF_ERR_INT_ENA_M  (JPEG_EN_FRAME_EOF_ERR_INT_ENA_V << JPEG_EN_FRAME_EOF_ERR_INT_ENA_S)
#define JPEG_EN_FRAME_EOF_ERR_INT_ENA_V  0x00000001U
#define JPEG_EN_FRAME_EOF_ERR_INT_ENA_S  16
/** JPEG_EN_FRAME_EOF_LACK_INT_ENA : R/W; bitpos: [17]; default: 0;
 *  The enable interrupt bit to sign that the frame eof sign bit from dma input is
 *  missing when encoding. But the number of pixel blocks is enough.
 */
#define JPEG_EN_FRAME_EOF_LACK_INT_ENA    (BIT(17))
#define JPEG_EN_FRAME_EOF_LACK_INT_ENA_M  (JPEG_EN_FRAME_EOF_LACK_INT_ENA_V << JPEG_EN_FRAME_EOF_LACK_INT_ENA_S)
#define JPEG_EN_FRAME_EOF_LACK_INT_ENA_V  0x00000001U
#define JPEG_EN_FRAME_EOF_LACK_INT_ENA_S  17
/** JPEG_DE_FRAME_EOF_ERR_INT_ENA : R/W; bitpos: [18]; default: 0;
 *  The enable interrupt bit to sign that decoded blocks are smaller than expected when
 *  decoding.
 */
#define JPEG_DE_FRAME_EOF_ERR_INT_ENA    (BIT(18))
#define JPEG_DE_FRAME_EOF_ERR_INT_ENA_M  (JPEG_DE_FRAME_EOF_ERR_INT_ENA_V << JPEG_DE_FRAME_EOF_ERR_INT_ENA_S)
#define JPEG_DE_FRAME_EOF_ERR_INT_ENA_V  0x00000001U
#define JPEG_DE_FRAME_EOF_ERR_INT_ENA_S  18
/** JPEG_DE_FRAME_EOF_LACK_INT_ENA : R/W; bitpos: [19]; default: 0;
 *  The enable interrupt bit to sign that the either frame eof from dma input or eoi
 *  marker is missing when encoding. But the number of decoded blocks is enough.
 */
#define JPEG_DE_FRAME_EOF_LACK_INT_ENA    (BIT(19))
#define JPEG_DE_FRAME_EOF_LACK_INT_ENA_M  (JPEG_DE_FRAME_EOF_LACK_INT_ENA_V << JPEG_DE_FRAME_EOF_LACK_INT_ENA_S)
#define JPEG_DE_FRAME_EOF_LACK_INT_ENA_V  0x00000001U
#define JPEG_DE_FRAME_EOF_LACK_INT_ENA_S  19
/** JPEG_SOS_UNMATCH_ERR_INT_ENA : R/W; bitpos: [20]; default: 0;
 *  The enable interrupt bit to sign that the component number of a scan is 0 or does
 *  not match the sos marker's length when decoding.
 */
#define JPEG_SOS_UNMATCH_ERR_INT_ENA    (BIT(20))
#define JPEG_SOS_UNMATCH_ERR_INT_ENA_M  (JPEG_SOS_UNMATCH_ERR_INT_ENA_V << JPEG_SOS_UNMATCH_ERR_INT_ENA_S)
#define JPEG_SOS_UNMATCH_ERR_INT_ENA_V  0x00000001U
#define JPEG_SOS_UNMATCH_ERR_INT_ENA_S  20
/** JPEG_MARKER_ERR_FST_SCAN_INT_ENA : R/W; bitpos: [21]; default: 0;
 *  The enable interrupt bit to sign that the first scan has header marker error when
 *  decoding.
 */
#define JPEG_MARKER_ERR_FST_SCAN_INT_ENA    (BIT(21))
#define JPEG_MARKER_ERR_FST_SCAN_INT_ENA_M  (JPEG_MARKER_ERR_FST_SCAN_INT_ENA_V << JPEG_MARKER_ERR_FST_SCAN_INT_ENA_S)
#define JPEG_MARKER_ERR_FST_SCAN_INT_ENA_V  0x00000001U
#define JPEG_MARKER_ERR_FST_SCAN_INT_ENA_S  21
/** JPEG_MARKER_ERR_OTHER_SCAN_INT_ENA : R/W; bitpos: [22]; default: 0;
 *  The enable interrupt bit to sign that the following scans but not the first scan
 *  have header marker error when decoding.
 */
#define JPEG_MARKER_ERR_OTHER_SCAN_INT_ENA    (BIT(22))
#define JPEG_MARKER_ERR_OTHER_SCAN_INT_ENA_M  (JPEG_MARKER_ERR_OTHER_SCAN_INT_ENA_V << JPEG_MARKER_ERR_OTHER_SCAN_INT_ENA_S)
#define JPEG_MARKER_ERR_OTHER_SCAN_INT_ENA_V  0x00000001U
#define JPEG_MARKER_ERR_OTHER_SCAN_INT_ENA_S  22
/** JPEG_UNDET_INT_ENA : R/W; bitpos: [23]; default: 0;
 *  The enable interrupt bit to sign that JPEG format is not detected at the eof data
 *  of a packet when decoding.
 */
#define JPEG_UNDET_INT_ENA    (BIT(23))
#define JPEG_UNDET_INT_ENA_M  (JPEG_UNDET_INT_ENA_V << JPEG_UNDET_INT_ENA_S)
#define JPEG_UNDET_INT_ENA_V  0x00000001U
#define JPEG_UNDET_INT_ENA_S  23
/** JPEG_DECODE_TIMEOUT_INT_ENA : R/W; bitpos: [24]; default: 0;
 *  The enable interrupt bit to sign that decode pause time is longer than the setting
 *  decode timeout time when decoding.
 */
#define JPEG_DECODE_TIMEOUT_INT_ENA    (BIT(24))
#define JPEG_DECODE_TIMEOUT_INT_ENA_M  (JPEG_DECODE_TIMEOUT_INT_ENA_V << JPEG_DECODE_TIMEOUT_INT_ENA_S)
#define JPEG_DECODE_TIMEOUT_INT_ENA_V  0x00000001U
#define JPEG_DECODE_TIMEOUT_INT_ENA_S  24

/** JPEG_INT_ST_REG register
 *  Interrupt status registers
 */
#define JPEG_INT_ST_REG (DR_REG_JPEG_BASE + 0x40)
/** JPEG_DONE_INT_ST : RO; bitpos: [0]; default: 0;
 *  This status interrupt bit turns to high level when JPEG finishes encoding a
 *  picture..
 */
#define JPEG_DONE_INT_ST    (BIT(0))
#define JPEG_DONE_INT_ST_M  (JPEG_DONE_INT_ST_V << JPEG_DONE_INT_ST_S)
#define JPEG_DONE_INT_ST_V  0x00000001U
#define JPEG_DONE_INT_ST_S  0
/** JPEG_RLE_PARALLEL_ERR_INT_ST : RO; bitpos: [1]; default: 0;
 *  The status interrupt bit to sign that rle parallel error when decoding.
 */
#define JPEG_RLE_PARALLEL_ERR_INT_ST    (BIT(1))
#define JPEG_RLE_PARALLEL_ERR_INT_ST_M  (JPEG_RLE_PARALLEL_ERR_INT_ST_V << JPEG_RLE_PARALLEL_ERR_INT_ST_S)
#define JPEG_RLE_PARALLEL_ERR_INT_ST_V  0x00000001U
#define JPEG_RLE_PARALLEL_ERR_INT_ST_S  1
/** JPEG_CID_ERR_INT_ST : RO; bitpos: [2]; default: 0;
 *  The status interrupt bit to sign that scan id check with component fails when
 *  decoding.
 */
#define JPEG_CID_ERR_INT_ST    (BIT(2))
#define JPEG_CID_ERR_INT_ST_M  (JPEG_CID_ERR_INT_ST_V << JPEG_CID_ERR_INT_ST_S)
#define JPEG_CID_ERR_INT_ST_V  0x00000001U
#define JPEG_CID_ERR_INT_ST_S  2
/** JPEG_C_DHT_DC_ID_ERR_INT_ST : RO; bitpos: [3]; default: 0;
 *  The status interrupt bit to sign that scan component's dc dht id check with dc dht
 *  table's id fails when decoding.
 */
#define JPEG_C_DHT_DC_ID_ERR_INT_ST    (BIT(3))
#define JPEG_C_DHT_DC_ID_ERR_INT_ST_M  (JPEG_C_DHT_DC_ID_ERR_INT_ST_V << JPEG_C_DHT_DC_ID_ERR_INT_ST_S)
#define JPEG_C_DHT_DC_ID_ERR_INT_ST_V  0x00000001U
#define JPEG_C_DHT_DC_ID_ERR_INT_ST_S  3
/** JPEG_C_DHT_AC_ID_ERR_INT_ST : RO; bitpos: [4]; default: 0;
 *  The status interrupt bit to sign that scan component's ac dht id check with ac dht
 *  table's id fails when decoding.
 */
#define JPEG_C_DHT_AC_ID_ERR_INT_ST    (BIT(4))
#define JPEG_C_DHT_AC_ID_ERR_INT_ST_M  (JPEG_C_DHT_AC_ID_ERR_INT_ST_V << JPEG_C_DHT_AC_ID_ERR_INT_ST_S)
#define JPEG_C_DHT_AC_ID_ERR_INT_ST_V  0x00000001U
#define JPEG_C_DHT_AC_ID_ERR_INT_ST_S  4
/** JPEG_C_DQT_ID_ERR_INT_ST : RO; bitpos: [5]; default: 0;
 *  The status interrupt bit to sign that scan component's dqt id check with dqt
 *  table's id fails when decoding.
 */
#define JPEG_C_DQT_ID_ERR_INT_ST    (BIT(5))
#define JPEG_C_DQT_ID_ERR_INT_ST_M  (JPEG_C_DQT_ID_ERR_INT_ST_V << JPEG_C_DQT_ID_ERR_INT_ST_S)
#define JPEG_C_DQT_ID_ERR_INT_ST_V  0x00000001U
#define JPEG_C_DQT_ID_ERR_INT_ST_S  5
/** JPEG_RST_UXP_ERR_INT_ST : RO; bitpos: [6]; default: 0;
 *  The status interrupt bit to sign that RST header marker is detected but restart
 *  interval is 0 when decoding.
 */
#define JPEG_RST_UXP_ERR_INT_ST    (BIT(6))
#define JPEG_RST_UXP_ERR_INT_ST_M  (JPEG_RST_UXP_ERR_INT_ST_V << JPEG_RST_UXP_ERR_INT_ST_S)
#define JPEG_RST_UXP_ERR_INT_ST_V  0x00000001U
#define JPEG_RST_UXP_ERR_INT_ST_S  6
/** JPEG_RST_CHECK_NONE_ERR_INT_ST : RO; bitpos: [7]; default: 0;
 *  The status interrupt bit to sign that RST header marker is not detected but restart
 *  interval is not 0 when decoding.
 */
#define JPEG_RST_CHECK_NONE_ERR_INT_ST    (BIT(7))
#define JPEG_RST_CHECK_NONE_ERR_INT_ST_M  (JPEG_RST_CHECK_NONE_ERR_INT_ST_V << JPEG_RST_CHECK_NONE_ERR_INT_ST_S)
#define JPEG_RST_CHECK_NONE_ERR_INT_ST_V  0x00000001U
#define JPEG_RST_CHECK_NONE_ERR_INT_ST_S  7
/** JPEG_RST_CHECK_POS_ERR_INT_ST : RO; bitpos: [8]; default: 0;
 *  The status interrupt bit to sign that RST header marker position mismatches with
 *  restart interval when decoding.
 */
#define JPEG_RST_CHECK_POS_ERR_INT_ST    (BIT(8))
#define JPEG_RST_CHECK_POS_ERR_INT_ST_M  (JPEG_RST_CHECK_POS_ERR_INT_ST_V << JPEG_RST_CHECK_POS_ERR_INT_ST_S)
#define JPEG_RST_CHECK_POS_ERR_INT_ST_V  0x00000001U
#define JPEG_RST_CHECK_POS_ERR_INT_ST_S  8
/** JPEG_OUT_EOF_INT_ST : RO; bitpos: [9]; default: 0;
 *  The status interrupt bit turns to high level when the last pixel of one square has
 *  been transmitted for Tx channel.
 */
#define JPEG_OUT_EOF_INT_ST    (BIT(9))
#define JPEG_OUT_EOF_INT_ST_M  (JPEG_OUT_EOF_INT_ST_V << JPEG_OUT_EOF_INT_ST_S)
#define JPEG_OUT_EOF_INT_ST_V  0x00000001U
#define JPEG_OUT_EOF_INT_ST_S  9
/** JPEG_SR_COLOR_MODE_ERR_INT_ST : RO; bitpos: [10]; default: 0;
 *  The status interrupt bit to sign that the selected source color mode is not
 *  supported.
 */
#define JPEG_SR_COLOR_MODE_ERR_INT_ST    (BIT(10))
#define JPEG_SR_COLOR_MODE_ERR_INT_ST_M  (JPEG_SR_COLOR_MODE_ERR_INT_ST_V << JPEG_SR_COLOR_MODE_ERR_INT_ST_S)
#define JPEG_SR_COLOR_MODE_ERR_INT_ST_V  0x00000001U
#define JPEG_SR_COLOR_MODE_ERR_INT_ST_S  10
/** JPEG_DCT_DONE_INT_ST : RO; bitpos: [11]; default: 0;
 *  The status interrupt bit to sign that one dct calculation is finished.
 */
#define JPEG_DCT_DONE_INT_ST    (BIT(11))
#define JPEG_DCT_DONE_INT_ST_M  (JPEG_DCT_DONE_INT_ST_V << JPEG_DCT_DONE_INT_ST_S)
#define JPEG_DCT_DONE_INT_ST_V  0x00000001U
#define JPEG_DCT_DONE_INT_ST_S  11
/** JPEG_BS_LAST_BLOCK_EOF_INT_ST : RO; bitpos: [12]; default: 0;
 *  The status interrupt bit to sign that the coding process for last block is finished.
 */
#define JPEG_BS_LAST_BLOCK_EOF_INT_ST    (BIT(12))
#define JPEG_BS_LAST_BLOCK_EOF_INT_ST_M  (JPEG_BS_LAST_BLOCK_EOF_INT_ST_V << JPEG_BS_LAST_BLOCK_EOF_INT_ST_S)
#define JPEG_BS_LAST_BLOCK_EOF_INT_ST_V  0x00000001U
#define JPEG_BS_LAST_BLOCK_EOF_INT_ST_S  12
/** JPEG_SCAN_CHECK_NONE_ERR_INT_ST : RO; bitpos: [13]; default: 0;
 *  The status interrupt bit to sign that SOS header marker is not detected but there
 *  are still components left to be decoded.
 */
#define JPEG_SCAN_CHECK_NONE_ERR_INT_ST    (BIT(13))
#define JPEG_SCAN_CHECK_NONE_ERR_INT_ST_M  (JPEG_SCAN_CHECK_NONE_ERR_INT_ST_V << JPEG_SCAN_CHECK_NONE_ERR_INT_ST_S)
#define JPEG_SCAN_CHECK_NONE_ERR_INT_ST_V  0x00000001U
#define JPEG_SCAN_CHECK_NONE_ERR_INT_ST_S  13
/** JPEG_SCAN_CHECK_POS_ERR_INT_ST : RO; bitpos: [14]; default: 0;
 *  The status interrupt bit to sign that SOS header marker position wrong when
 *  decoding.
 */
#define JPEG_SCAN_CHECK_POS_ERR_INT_ST    (BIT(14))
#define JPEG_SCAN_CHECK_POS_ERR_INT_ST_M  (JPEG_SCAN_CHECK_POS_ERR_INT_ST_V << JPEG_SCAN_CHECK_POS_ERR_INT_ST_S)
#define JPEG_SCAN_CHECK_POS_ERR_INT_ST_V  0x00000001U
#define JPEG_SCAN_CHECK_POS_ERR_INT_ST_S  14
/** JPEG_UXP_DET_INT_ST : RO; bitpos: [15]; default: 0;
 *  The status interrupt bit to sign that unsupported header marker is detected when
 *  decoding.
 */
#define JPEG_UXP_DET_INT_ST    (BIT(15))
#define JPEG_UXP_DET_INT_ST_M  (JPEG_UXP_DET_INT_ST_V << JPEG_UXP_DET_INT_ST_S)
#define JPEG_UXP_DET_INT_ST_V  0x00000001U
#define JPEG_UXP_DET_INT_ST_S  15
/** JPEG_EN_FRAME_EOF_ERR_INT_ST : RO; bitpos: [16]; default: 0;
 *  The status interrupt bit to sign that received pixel blocks are smaller than
 *  expected when encoding.
 */
#define JPEG_EN_FRAME_EOF_ERR_INT_ST    (BIT(16))
#define JPEG_EN_FRAME_EOF_ERR_INT_ST_M  (JPEG_EN_FRAME_EOF_ERR_INT_ST_V << JPEG_EN_FRAME_EOF_ERR_INT_ST_S)
#define JPEG_EN_FRAME_EOF_ERR_INT_ST_V  0x00000001U
#define JPEG_EN_FRAME_EOF_ERR_INT_ST_S  16
/** JPEG_EN_FRAME_EOF_LACK_INT_ST : RO; bitpos: [17]; default: 0;
 *  The status interrupt bit to sign that the frame eof sign bit from dma input is
 *  missing when encoding. But the number of pixel blocks is enough.
 */
#define JPEG_EN_FRAME_EOF_LACK_INT_ST    (BIT(17))
#define JPEG_EN_FRAME_EOF_LACK_INT_ST_M  (JPEG_EN_FRAME_EOF_LACK_INT_ST_V << JPEG_EN_FRAME_EOF_LACK_INT_ST_S)
#define JPEG_EN_FRAME_EOF_LACK_INT_ST_V  0x00000001U
#define JPEG_EN_FRAME_EOF_LACK_INT_ST_S  17
/** JPEG_DE_FRAME_EOF_ERR_INT_ST : RO; bitpos: [18]; default: 0;
 *  The status interrupt bit to sign that decoded blocks are smaller than expected when
 *  decoding.
 */
#define JPEG_DE_FRAME_EOF_ERR_INT_ST    (BIT(18))
#define JPEG_DE_FRAME_EOF_ERR_INT_ST_M  (JPEG_DE_FRAME_EOF_ERR_INT_ST_V << JPEG_DE_FRAME_EOF_ERR_INT_ST_S)
#define JPEG_DE_FRAME_EOF_ERR_INT_ST_V  0x00000001U
#define JPEG_DE_FRAME_EOF_ERR_INT_ST_S  18
/** JPEG_DE_FRAME_EOF_LACK_INT_ST : RO; bitpos: [19]; default: 0;
 *  The status interrupt bit to sign that the either frame eof from dma input or eoi
 *  marker is missing when encoding. But the number of decoded blocks is enough.
 */
#define JPEG_DE_FRAME_EOF_LACK_INT_ST    (BIT(19))
#define JPEG_DE_FRAME_EOF_LACK_INT_ST_M  (JPEG_DE_FRAME_EOF_LACK_INT_ST_V << JPEG_DE_FRAME_EOF_LACK_INT_ST_S)
#define JPEG_DE_FRAME_EOF_LACK_INT_ST_V  0x00000001U
#define JPEG_DE_FRAME_EOF_LACK_INT_ST_S  19
/** JPEG_SOS_UNMATCH_ERR_INT_ST : RO; bitpos: [20]; default: 0;
 *  The status interrupt bit to sign that the component number of a scan is 0 or does
 *  not match the sos marker's length when decoding.
 */
#define JPEG_SOS_UNMATCH_ERR_INT_ST    (BIT(20))
#define JPEG_SOS_UNMATCH_ERR_INT_ST_M  (JPEG_SOS_UNMATCH_ERR_INT_ST_V << JPEG_SOS_UNMATCH_ERR_INT_ST_S)
#define JPEG_SOS_UNMATCH_ERR_INT_ST_V  0x00000001U
#define JPEG_SOS_UNMATCH_ERR_INT_ST_S  20
/** JPEG_MARKER_ERR_FST_SCAN_INT_ST : RO; bitpos: [21]; default: 0;
 *  The status interrupt bit to sign that the first scan has header marker error when
 *  decoding.
 */
#define JPEG_MARKER_ERR_FST_SCAN_INT_ST    (BIT(21))
#define JPEG_MARKER_ERR_FST_SCAN_INT_ST_M  (JPEG_MARKER_ERR_FST_SCAN_INT_ST_V << JPEG_MARKER_ERR_FST_SCAN_INT_ST_S)
#define JPEG_MARKER_ERR_FST_SCAN_INT_ST_V  0x00000001U
#define JPEG_MARKER_ERR_FST_SCAN_INT_ST_S  21
/** JPEG_MARKER_ERR_OTHER_SCAN_INT_ST : RO; bitpos: [22]; default: 0;
 *  The status interrupt bit to sign that the following scans but not the first scan
 *  have header marker error when decoding.
 */
#define JPEG_MARKER_ERR_OTHER_SCAN_INT_ST    (BIT(22))
#define JPEG_MARKER_ERR_OTHER_SCAN_INT_ST_M  (JPEG_MARKER_ERR_OTHER_SCAN_INT_ST_V << JPEG_MARKER_ERR_OTHER_SCAN_INT_ST_S)
#define JPEG_MARKER_ERR_OTHER_SCAN_INT_ST_V  0x00000001U
#define JPEG_MARKER_ERR_OTHER_SCAN_INT_ST_S  22
/** JPEG_UNDET_INT_ST : RO; bitpos: [23]; default: 0;
 *  The status interrupt bit to sign that JPEG format is not detected at the eof data
 *  of a packet when decoding.
 */
#define JPEG_UNDET_INT_ST    (BIT(23))
#define JPEG_UNDET_INT_ST_M  (JPEG_UNDET_INT_ST_V << JPEG_UNDET_INT_ST_S)
#define JPEG_UNDET_INT_ST_V  0x00000001U
#define JPEG_UNDET_INT_ST_S  23
/** JPEG_DECODE_TIMEOUT_INT_ST : RO; bitpos: [24]; default: 0;
 *  The status interrupt bit to sign that decode pause time is longer than the setting
 *  decode timeout time when decoding.
 */
#define JPEG_DECODE_TIMEOUT_INT_ST    (BIT(24))
#define JPEG_DECODE_TIMEOUT_INT_ST_M  (JPEG_DECODE_TIMEOUT_INT_ST_V << JPEG_DECODE_TIMEOUT_INT_ST_S)
#define JPEG_DECODE_TIMEOUT_INT_ST_V  0x00000001U
#define JPEG_DECODE_TIMEOUT_INT_ST_S  24

