espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/jpeg_reg.h
/** JPEG_STATUS2_REG register
 *  Trace and Debug registers
 */
#define JPEG_STATUS2_REG (DR_REG_JPEG_BASE + 0x4c)
/** JPEG_SOURCE_PIXEL : RO; bitpos: [23:0]; default: 0;
 *  source pixels fetched from dma
 */
#define JPEG_SOURCE_PIXEL    0x00FFFFFFU
#define JPEG_SOURCE_PIXEL_M  (JPEG_SOURCE_PIXEL_V << JPEG_SOURCE_PIXEL_S)
#define JPEG_SOURCE_PIXEL_V  0x00FFFFFFU
#define JPEG_SOURCE_PIXEL_S  0
/** JPEG_LAST_BLOCK : RO; bitpos: [24]; default: 0;
 *  indicate the encoding process for the last mcu of the picture
 */
#define JPEG_LAST_BLOCK    (BIT(24))
#define JPEG_LAST_BLOCK_M  (JPEG_LAST_BLOCK_V << JPEG_LAST_BLOCK_S)
#define JPEG_LAST_BLOCK_V  0x00000001U
#define JPEG_LAST_BLOCK_S  24
/** JPEG_LAST_MCU : RO; bitpos: [25]; default: 0;
 *  indicate the encoding process for the last block of the picture
 */
#define JPEG_LAST_MCU    (BIT(25))
#define JPEG_LAST_MCU_M  (JPEG_LAST_MCU_V << JPEG_LAST_MCU_S)
#define JPEG_LAST_MCU_V  0x00000001U
#define JPEG_LAST_MCU_S  25
/** JPEG_LAST_DC : RO; bitpos: [26]; default: 0;
 *  indicate the encoding process is at the header of the last block of the picture
 */
#define JPEG_LAST_DC    (BIT(26))
#define JPEG_LAST_DC_M  (JPEG_LAST_DC_V << JPEG_LAST_DC_S)
#define JPEG_LAST_DC_V  0x00000001U
#define JPEG_LAST_DC_S  26
/** JPEG_PACKFIFO_READY : RO; bitpos: [27]; default: 1;
 *  the jpeg pack_fifo ready signal, high active
 */
#define JPEG_PACKFIFO_READY    (BIT(27))
#define JPEG_PACKFIFO_READY_M  (JPEG_PACKFIFO_READY_V << JPEG_PACKFIFO_READY_S)
#define JPEG_PACKFIFO_READY_V  0x00000001U
#define JPEG_PACKFIFO_READY_S  27

/** JPEG_STATUS3_REG register
 *  Trace and Debug registers
 */
#define JPEG_STATUS3_REG (DR_REG_JPEG_BASE + 0x50)
/** JPEG_YO : RO; bitpos: [8:0]; default: 0;
 *  component y transferred from rgb input
 */
#define JPEG_YO    0x000001FFU
#define JPEG_YO_M  (JPEG_YO_V << JPEG_YO_S)
#define JPEG_YO_V  0x000001FFU
#define JPEG_YO_S  0
/** JPEG_Y_READY : RO; bitpos: [9]; default: 0;
 *  component y valid signal, high active
 */
#define JPEG_Y_READY    (BIT(9))
#define JPEG_Y_READY_M  (JPEG_Y_READY_V << JPEG_Y_READY_S)
#define JPEG_Y_READY_V  0x00000001U
#define JPEG_Y_READY_S  9
/** JPEG_CBO : RO; bitpos: [18:10]; default: 0;
 *  component cb transferred from rgb input
 */
#define JPEG_CBO    0x000001FFU
#define JPEG_CBO_M  (JPEG_CBO_V << JPEG_CBO_S)
#define JPEG_CBO_V  0x000001FFU
#define JPEG_CBO_S  10
/** JPEG_CB_READY : RO; bitpos: [19]; default: 0;
 *  component cb valid signal, high active
 */
#define JPEG_CB_READY    (BIT(19))
#define JPEG_CB_READY_M  (JPEG_CB_READY_V << JPEG_CB_READY_S)
#define JPEG_CB_READY_V  0x00000001U
#define JPEG_CB_READY_S  19
/** JPEG_CRO : RO; bitpos: [28:20]; default: 0;
 *  component cr transferred from rgb input
 */
#define JPEG_CRO    0x000001FFU
#define JPEG_CRO_M  (JPEG_CRO_V << JPEG_CRO_S)
#define JPEG_CRO_V  0x000001FFU
#define JPEG_CRO_S  20
/** JPEG_CR_READY : RO; bitpos: [29]; default: 0;
 *  component cr valid signal, high active
 */
#define JPEG_CR_READY    (BIT(29))
#define JPEG_CR_READY_M  (JPEG_CR_READY_V << JPEG_CR_READY_S)
#define JPEG_CR_READY_V  0x00000001U
#define JPEG_CR_READY_S  29

/** JPEG_STATUS4_REG register
 *  Trace and Debug registers
 */
#define JPEG_STATUS4_REG (DR_REG_JPEG_BASE + 0x54)
/** JPEG_HFM_BITSTREAM : RO; bitpos: [31:0]; default: 0;
 *  the hufman bitstream during encoding process
 */
#define JPEG_HFM_BITSTREAM    0xFFFFFFFFU
#define JPEG_HFM_BITSTREAM_M  (JPEG_HFM_BITSTREAM_V << JPEG_HFM_BITSTREAM_S)
#define JPEG_HFM_BITSTREAM_V  0xFFFFFFFFU
#define JPEG_HFM_BITSTREAM_S  0

/** JPEG_DHT_TOTLEN_DC0_REG register
 *  Trace and Debug registers
 */
#define JPEG_DHT_TOTLEN_DC0_REG (DR_REG_JPEG_BASE + 0x58)
/** JPEG_DHT_TOTLEN_DC0 : HRO; bitpos: [31:0]; default: 0;
 *  write the numbers of 1~n codeword length sum from 1~16 of dc0 table
 */
#define JPEG_DHT_TOTLEN_DC0    0xFFFFFFFFU
#define JPEG_DHT_TOTLEN_DC0_M  (JPEG_DHT_TOTLEN_DC0_V << JPEG_DHT_TOTLEN_DC0_S)
#define JPEG_DHT_TOTLEN_DC0_V  0xFFFFFFFFU
#define JPEG_DHT_TOTLEN_DC0_S  0

/** JPEG_DHT_VAl_DC0_REG register
 *  Trace and Debug registers
 */
#define JPEG_DHT_VAL_DC0_REG (DR_REG_JPEG_BASE + 0x5c)
/** JPEG_DHT_VAL_DC0 : HRO; bitpos: [31:0]; default: 0;
 *  write codeword corresponding huffman values of dc0 table
 */
#define JPEG_DHT_VAL_DC0    0xFFFFFFFFU
#define JPEG_DHT_VAL_DC0_M  (JPEG_DHT_VAL_DC0_V << JPEG_DHT_VAL_DC0_S)
#define JPEG_DHT_VAL_DC0_V  0xFFFFFFFFU
#define JPEG_DHT_VAL_DC0_S  0

/** JPEG_DHT_TOTLEN_AC0_REG register
 *  Trace and Debug registers
 */
#define JPEG_DHT_TOTLEN_AC0_REG (DR_REG_JPEG_BASE + 0x60)
/** JPEG_DHT_TOTLEN_AC0 : HRO; bitpos: [31:0]; default: 0;
 *  write the numbers of 1~n codeword length sum from 1~16 of ac0 table
 */
#define JPEG_DHT_TOTLEN_AC0    0xFFFFFFFFU
#define JPEG_DHT_TOTLEN_AC0_M  (JPEG_DHT_TOTLEN_AC0_V << JPEG_DHT_TOTLEN_AC0_S)
#define JPEG_DHT_TOTLEN_AC0_V  0xFFFFFFFFU
#define JPEG_DHT_TOTLEN_AC0_S  0

/** JPEG_DHT_VAl_AC0_REG register
 *  Trace and Debug registers
 */
#define JPEG_DHT_VAL_AC0_REG (DR_REG_JPEG_BASE + 0x64)
/** JPEG_DHT_VAL_AC0 : HRO; bitpos: [31:0]; default: 0;
 *  write codeword corresponding huffman values of ac0 table
 */
#define JPEG_DHT_VAL_AC0    0xFFFFFFFFU
#define JPEG_DHT_VAL_AC0_M  (JPEG_DHT_VAL_AC0_V << JPEG_DHT_VAL_AC0_S)
#define JPEG_DHT_VAL_AC0_V  0xFFFFFFFFU
#define JPEG_DHT_VAL_AC0_S  0

/** JPEG_DHT_TOTLEN_DC1_REG register
 *  Trace and Debug registers
 */
#define JPEG_DHT_TOTLEN_DC1_REG (DR_REG_JPEG_BASE + 0x68)
/** JPEG_DHT_TOTLEN_DC1 : HRO; bitpos: [31:0]; default: 0;
 *  write the numbers of 1~n codeword length sum from 1~16 of dc1 table
 */
#define JPEG_DHT_TOTLEN_DC1    0xFFFFFFFFU
#define JPEG_DHT_TOTLEN_DC1_M  (JPEG_DHT_TOTLEN_DC1_V << JPEG_DHT_TOTLEN_DC1_S)
#define JPEG_DHT_TOTLEN_DC1_V  0xFFFFFFFFU
#define JPEG_DHT_TOTLEN_DC1_S  0

/** JPEG_DHT_VAl_DC1_REG register
 *  Trace and Debug registers
 */
#define JPEG_DHT_VAL_DC1_REG (DR_REG_JPEG_BASE + 0x6c)
/** JPEG_DHT_VAL_DC1 : HRO; bitpos: [31:0]; default: 0;
 *  write codeword corresponding huffman values of dc1 table
 */
#define JPEG_DHT_VAL_DC1    0xFFFFFFFFU
#define JPEG_DHT_VAL_DC1_M  (JPEG_DHT_VAL_DC1_V << JPEG_DHT_VAL_DC1_S)
#define JPEG_DHT_VAL_DC1_V  0xFFFFFFFFU
#define JPEG_DHT_VAL_DC1_S  0

/** JPEG_DHT_TOTLEN_AC1_REG register
 *  Trace and Debug registers
 */
#define JPEG_DHT_TOTLEN_AC1_REG (DR_REG_JPEG_BASE + 0x70)
/** JPEG_DHT_TOTLEN_AC1 : HRO; bitpos: [31:0]; default: 0;
 *  write the numbers of 1~n codeword length sum from 1~16 of ac1 table
 */
#define JPEG_DHT_TOTLEN_AC1    0xFFFFFFFFU
#define JPEG_DHT_TOTLEN_AC1_M  (JPEG_DHT_TOTLEN_AC1_V << JPEG_DHT_TOTLEN_AC1_S)
#define JPEG_DHT_TOTLEN_AC1_V  0xFFFFFFFFU
#define JPEG_DHT_TOTLEN_AC1_S  0

