espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/jpeg_reg.h
/** JPEG_DHT_VAl_AC1_REG register
 *  Trace and Debug registers
 */
#define JPEG_DHT_VAL_AC1_REG (DR_REG_JPEG_BASE + 0x74)
/** JPEG_DHT_VAL_AC1 : HRO; bitpos: [31:0]; default: 0;
 *  write codeword corresponding huffman values of ac1 table
 */
#define JPEG_DHT_VAL_AC1    0xFFFFFFFFU
#define JPEG_DHT_VAL_AC1_M  (JPEG_DHT_VAL_AC1_V << JPEG_DHT_VAL_AC1_S)
#define JPEG_DHT_VAL_AC1_V  0xFFFFFFFFU
#define JPEG_DHT_VAL_AC1_S  0

/** JPEG_DHT_CODEMIN_DC0_REG register
 *  Trace and Debug registers
 */
#define JPEG_DHT_CODEMIN_DC0_REG (DR_REG_JPEG_BASE + 0x78)
/** JPEG_DHT_CODEMIN_DC0 : HRO; bitpos: [31:0]; default: 0;
 *  write the minimum codeword of  code length from 1~16 of dc0 table. The codeword is
 *  left shifted to the MSB position of a 16bit word
 */
#define JPEG_DHT_CODEMIN_DC0    0xFFFFFFFFU
#define JPEG_DHT_CODEMIN_DC0_M  (JPEG_DHT_CODEMIN_DC0_V << JPEG_DHT_CODEMIN_DC0_S)
#define JPEG_DHT_CODEMIN_DC0_V  0xFFFFFFFFU
#define JPEG_DHT_CODEMIN_DC0_S  0

/** JPEG_DHT_CODEMIN_AC0_REG register
 *  Trace and Debug registers
 */
#define JPEG_DHT_CODEMIN_AC0_REG (DR_REG_JPEG_BASE + 0x7c)
/** JPEG_DHT_CODEMIN_AC0 : HRO; bitpos: [31:0]; default: 0;
 *  write the minimum codeword of  code length from 1~16 of ac0 table. The codeword is
 *  left shifted to the MSB position of a 16bit word
 */
#define JPEG_DHT_CODEMIN_AC0    0xFFFFFFFFU
#define JPEG_DHT_CODEMIN_AC0_M  (JPEG_DHT_CODEMIN_AC0_V << JPEG_DHT_CODEMIN_AC0_S)
#define JPEG_DHT_CODEMIN_AC0_V  0xFFFFFFFFU
#define JPEG_DHT_CODEMIN_AC0_S  0

/** JPEG_DHT_CODEMIN_DC1_REG register
 *  Trace and Debug registers
 */
#define JPEG_DHT_CODEMIN_DC1_REG (DR_REG_JPEG_BASE + 0x80)
/** JPEG_DHT_CODEMIN_DC1 : HRO; bitpos: [31:0]; default: 0;
 *  write the minimum codeword of  code length from 1~16 of dc1 table. The codeword is
 *  left shifted to the MSB position of a 16bit word
 */
#define JPEG_DHT_CODEMIN_DC1    0xFFFFFFFFU
#define JPEG_DHT_CODEMIN_DC1_M  (JPEG_DHT_CODEMIN_DC1_V << JPEG_DHT_CODEMIN_DC1_S)
#define JPEG_DHT_CODEMIN_DC1_V  0xFFFFFFFFU
#define JPEG_DHT_CODEMIN_DC1_S  0

/** JPEG_DHT_CODEMIN_AC1_REG register
 *  Trace and Debug registers
 */
#define JPEG_DHT_CODEMIN_AC1_REG (DR_REG_JPEG_BASE + 0x84)
/** JPEG_DHT_CODEMIN_AC1 : HRO; bitpos: [31:0]; default: 0;
 *  write the minimum codeword of  code length from 1~16 of ac1 table. The codeword is
 *  left shifted to the MSB position of a 16bit word
 */
#define JPEG_DHT_CODEMIN_AC1    0xFFFFFFFFU
#define JPEG_DHT_CODEMIN_AC1_M  (JPEG_DHT_CODEMIN_AC1_V << JPEG_DHT_CODEMIN_AC1_S)
#define JPEG_DHT_CODEMIN_AC1_V  0xFFFFFFFFU
#define JPEG_DHT_CODEMIN_AC1_S  0

/** JPEG_DECODER_STATUS0_REG register
 *  Trace and Debug registers
 */
#define JPEG_DECODER_STATUS0_REG (DR_REG_JPEG_BASE + 0x88)
/** JPEG_DECODE_BYTE_CNT : RO; bitpos: [25:0]; default: 0;
 *  Reserved
 */
#define JPEG_DECODE_BYTE_CNT    0x03FFFFFFU
#define JPEG_DECODE_BYTE_CNT_M  (JPEG_DECODE_BYTE_CNT_V << JPEG_DECODE_BYTE_CNT_S)
#define JPEG_DECODE_BYTE_CNT_V  0x03FFFFFFU
#define JPEG_DECODE_BYTE_CNT_S  0
/** JPEG_HEADER_DEC_ST : RO; bitpos: [29:26]; default: 0;
 *  Reserved
 */
#define JPEG_HEADER_DEC_ST    0x0000000FU
#define JPEG_HEADER_DEC_ST_M  (JPEG_HEADER_DEC_ST_V << JPEG_HEADER_DEC_ST_S)
#define JPEG_HEADER_DEC_ST_V  0x0000000FU
#define JPEG_HEADER_DEC_ST_S  26
/** JPEG_DECODE_SAMPLE_SEL : RO; bitpos: [31:30]; default: 0;
 *  Reserved
 */
#define JPEG_DECODE_SAMPLE_SEL    0x00000003U
#define JPEG_DECODE_SAMPLE_SEL_M  (JPEG_DECODE_SAMPLE_SEL_V << JPEG_DECODE_SAMPLE_SEL_S)
#define JPEG_DECODE_SAMPLE_SEL_V  0x00000003U
#define JPEG_DECODE_SAMPLE_SEL_S  30

/** JPEG_DECODER_STATUS1_REG register
 *  Trace and Debug registers
 */
#define JPEG_DECODER_STATUS1_REG (DR_REG_JPEG_BASE + 0x8c)
/** JPEG_ENCODE_DATA : RO; bitpos: [15:0]; default: 0;
 *  Reserved
 */
#define JPEG_ENCODE_DATA    0x0000FFFFU
#define JPEG_ENCODE_DATA_M  (JPEG_ENCODE_DATA_V << JPEG_ENCODE_DATA_S)
#define JPEG_ENCODE_DATA_V  0x0000FFFFU
#define JPEG_ENCODE_DATA_S  0
/** JPEG_COUNT_Q : RO; bitpos: [22:16]; default: 0;
 *  Reserved
 */
#define JPEG_COUNT_Q    0x0000007FU
#define JPEG_COUNT_Q_M  (JPEG_COUNT_Q_V << JPEG_COUNT_Q_S)
#define JPEG_COUNT_Q_V  0x0000007FU
#define JPEG_COUNT_Q_S  16
/** JPEG_MCU_FSM_READY : RO; bitpos: [23]; default: 0;
 *  Reserved
 */
#define JPEG_MCU_FSM_READY    (BIT(23))
#define JPEG_MCU_FSM_READY_M  (JPEG_MCU_FSM_READY_V << JPEG_MCU_FSM_READY_S)
#define JPEG_MCU_FSM_READY_V  0x00000001U
#define JPEG_MCU_FSM_READY_S  23
/** JPEG_DECODE_DATA : RO; bitpos: [31:24]; default: 0;
 *  Reserved
 */
#define JPEG_DECODE_DATA    0x000000FFU
#define JPEG_DECODE_DATA_M  (JPEG_DECODE_DATA_V << JPEG_DECODE_DATA_S)
#define JPEG_DECODE_DATA_V  0x000000FFU
#define JPEG_DECODE_DATA_S  24

/** JPEG_DECODER_STATUS2_REG register
 *  Trace and Debug registers
 */
#define JPEG_DECODER_STATUS2_REG (DR_REG_JPEG_BASE + 0x90)
/** JPEG_COMP_BLOCK_NUM : RO; bitpos: [25:0]; default: 0;
 *  Reserved
 */
#define JPEG_COMP_BLOCK_NUM    0x03FFFFFFU
#define JPEG_COMP_BLOCK_NUM_M  (JPEG_COMP_BLOCK_NUM_V << JPEG_COMP_BLOCK_NUM_S)
#define JPEG_COMP_BLOCK_NUM_V  0x03FFFFFFU
#define JPEG_COMP_BLOCK_NUM_S  0
/** JPEG_SCAN_NUM : RO; bitpos: [28:26]; default: 0;
 *  Reserved
 */
#define JPEG_SCAN_NUM    0x00000007U
#define JPEG_SCAN_NUM_M  (JPEG_SCAN_NUM_V << JPEG_SCAN_NUM_S)
#define JPEG_SCAN_NUM_V  0x00000007U
#define JPEG_SCAN_NUM_S  26
/** JPEG_RST_CHECK_WAIT : RO; bitpos: [29]; default: 0;
 *  Reserved
 */
#define JPEG_RST_CHECK_WAIT    (BIT(29))
#define JPEG_RST_CHECK_WAIT_M  (JPEG_RST_CHECK_WAIT_V << JPEG_RST_CHECK_WAIT_S)
#define JPEG_RST_CHECK_WAIT_V  0x00000001U
#define JPEG_RST_CHECK_WAIT_S  29
/** JPEG_SCAN_CHECK_WAIT : RO; bitpos: [30]; default: 0;
 *  Reserved
 */
#define JPEG_SCAN_CHECK_WAIT    (BIT(30))
#define JPEG_SCAN_CHECK_WAIT_M  (JPEG_SCAN_CHECK_WAIT_V << JPEG_SCAN_CHECK_WAIT_S)
#define JPEG_SCAN_CHECK_WAIT_V  0x00000001U
#define JPEG_SCAN_CHECK_WAIT_S  30
/** JPEG_MCU_IN_PROC : RO; bitpos: [31]; default: 0;
 *  Reserved
 */
#define JPEG_MCU_IN_PROC    (BIT(31))
#define JPEG_MCU_IN_PROC_M  (JPEG_MCU_IN_PROC_V << JPEG_MCU_IN_PROC_S)
#define JPEG_MCU_IN_PROC_V  0x00000001U
#define JPEG_MCU_IN_PROC_S  31

/** JPEG_DECODER_STATUS3_REG register
 *  Trace and Debug registers
 */
#define JPEG_DECODER_STATUS3_REG (DR_REG_JPEG_BASE + 0x94)
/** JPEG_LOOKUP_DATA : RO; bitpos: [31:0]; default: 0;
 *  Reserved
 */
#define JPEG_LOOKUP_DATA    0xFFFFFFFFU
#define JPEG_LOOKUP_DATA_M  (JPEG_LOOKUP_DATA_V << JPEG_LOOKUP_DATA_S)
#define JPEG_LOOKUP_DATA_V  0xFFFFFFFFU
#define JPEG_LOOKUP_DATA_S  0

/** JPEG_DECODER_STATUS4_REG register
 *  Trace and Debug registers
 */
#define JPEG_DECODER_STATUS4_REG (DR_REG_JPEG_BASE + 0x98)
/** JPEG_BLOCK_EOF_CNT : RO; bitpos: [25:0]; default: 0;
 *  Reserved
 */
#define JPEG_BLOCK_EOF_CNT    0x03FFFFFFU
#define JPEG_BLOCK_EOF_CNT_M  (JPEG_BLOCK_EOF_CNT_V << JPEG_BLOCK_EOF_CNT_S)
#define JPEG_BLOCK_EOF_CNT_V  0x03FFFFFFU
#define JPEG_BLOCK_EOF_CNT_S  0
/** JPEG_DEZIGZAG_READY : RO; bitpos: [26]; default: 0;
 *  Reserved
 */
#define JPEG_DEZIGZAG_READY    (BIT(26))
#define JPEG_DEZIGZAG_READY_M  (JPEG_DEZIGZAG_READY_V << JPEG_DEZIGZAG_READY_S)
#define JPEG_DEZIGZAG_READY_V  0x00000001U
#define JPEG_DEZIGZAG_READY_S  26
/** JPEG_DE_FRAME_EOF_CHECK : RO; bitpos: [27]; default: 0;
 *  Reserved
 */
#define JPEG_DE_FRAME_EOF_CHECK    (BIT(27))
#define JPEG_DE_FRAME_EOF_CHECK_M  (JPEG_DE_FRAME_EOF_CHECK_V << JPEG_DE_FRAME_EOF_CHECK_S)
#define JPEG_DE_FRAME_EOF_CHECK_V  0x00000001U
#define JPEG_DE_FRAME_EOF_CHECK_S  27
/** JPEG_DE_DMA2D_IN_PUSH : RO; bitpos: [28]; default: 0;
 *  Reserved
 */
#define JPEG_DE_DMA2D_IN_PUSH    (BIT(28))
#define JPEG_DE_DMA2D_IN_PUSH_M  (JPEG_DE_DMA2D_IN_PUSH_V << JPEG_DE_DMA2D_IN_PUSH_S)
#define JPEG_DE_DMA2D_IN_PUSH_V  0x00000001U
#define JPEG_DE_DMA2D_IN_PUSH_S  28

/** JPEG_DECODER_STATUS5_REG register
 *  Trace and Debug registers
 */
#define JPEG_DECODER_STATUS5_REG (DR_REG_JPEG_BASE + 0x9c)
/** JPEG_IDCT_HFM_DATA : RO; bitpos: [15:0]; default: 0;
 *  Reserved
 */
#define JPEG_IDCT_HFM_DATA    0x0000FFFFU
#define JPEG_IDCT_HFM_DATA_M  (JPEG_IDCT_HFM_DATA_V << JPEG_IDCT_HFM_DATA_S)
#define JPEG_IDCT_HFM_DATA_V  0x0000FFFFU
#define JPEG_IDCT_HFM_DATA_S  0
/** JPEG_NS0 : RO; bitpos: [18:16]; default: 0;
 *  Reserved
 */
#define JPEG_NS0    0x00000007U
#define JPEG_NS0_M  (JPEG_NS0_V << JPEG_NS0_S)
#define JPEG_NS0_V  0x00000007U
#define JPEG_NS0_S  16
/** JPEG_NS1 : RO; bitpos: [21:19]; default: 0;
 *  Reserved
 */
#define JPEG_NS1    0x00000007U
#define JPEG_NS1_M  (JPEG_NS1_V << JPEG_NS1_S)
#define JPEG_NS1_V  0x00000007U
#define JPEG_NS1_S  19
/** JPEG_NS2 : RO; bitpos: [24:22]; default: 0;
 *  Reserved
 */
#define JPEG_NS2    0x00000007U
#define JPEG_NS2_M  (JPEG_NS2_V << JPEG_NS2_S)
#define JPEG_NS2_V  0x00000007U
#define JPEG_NS2_S  22
/** JPEG_NS3 : RO; bitpos: [27:25]; default: 0;
 *  Reserved
 */
#define JPEG_NS3    0x00000007U
#define JPEG_NS3_M  (JPEG_NS3_V << JPEG_NS3_S)
#define JPEG_NS3_V  0x00000007U
#define JPEG_NS3_S  25
/** JPEG_DATA_LAST_O : RO; bitpos: [28]; default: 0;
 *  Reserved
 */
#define JPEG_DATA_LAST_O    (BIT(28))
#define JPEG_DATA_LAST_O_M  (JPEG_DATA_LAST_O_V << JPEG_DATA_LAST_O_S)
#define JPEG_DATA_LAST_O_V  0x00000001U
#define JPEG_DATA_LAST_O_S  28
/** JPEG_RDN_RESULT : RO; bitpos: [29]; default: 0;
 *  redundant registers for jpeg
 */
#define JPEG_RDN_RESULT    (BIT(29))
#define JPEG_RDN_RESULT_M  (JPEG_RDN_RESULT_V << JPEG_RDN_RESULT_S)
#define JPEG_RDN_RESULT_V  0x00000001U
#define JPEG_RDN_RESULT_S  29
/** JPEG_RDN_ENA : R/W; bitpos: [30]; default: 0;
 *  redundant control registers for jpeg
 */
#define JPEG_RDN_ENA    (BIT(30))
#define JPEG_RDN_ENA_M  (JPEG_RDN_ENA_V << JPEG_RDN_ENA_S)
#define JPEG_RDN_ENA_V  0x00000001U
#define JPEG_RDN_ENA_S  30

